src/config/Reports/ОборотыМежду6001И6205.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Report>
		<Properties>
			<Name>ОборотыМежду6001И6205</Name>
		</Properties>
	</Report>
</MetaDataObject>

src/config/ChartsOfCharacteristicTypes/ДополнительныеРеквизитыИСведения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>ДополнительныеРеквизитыИСведения</Name>
			<Type>
				<v8:Type>cfg:CatalogRef.ЗначенияСвойствОбъектовИерархия</v8:Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>cfg:CatalogRef.ЗначенияСвойствОбъектов</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>17</v8:Digits>
					<v8:FractionDigits>5</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>1024</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>DateTime</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>false</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Виден</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецДополнительныхЗначений</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВВидеГиперссылки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеЗначенияИспользуются</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеЗначенияСВесом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доступен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокФормыВыбораЗначения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокФормыВыбораЗначенияЯзык1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокФормыВыбораЗначенияЯзык2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокФормыЗначения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокФормыЗначенияЯзык1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокФормыЗначенияЯзык2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокЯзык1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокЯзык2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнятьОбязательно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДляФормул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МногострочноеПолеВвода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборСвойств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подсказка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодсказкаЯзык1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодсказкаЯзык2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматСвойства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоДополнительноеСведение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗависимостиДополнительныхРеквизитов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗависимоеСвойство</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаборСвойств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>99</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Условие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Представления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодЯзыка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заголовок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>75</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подсказка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаголовокФормыЗначения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаголовокФормыВыбораЗначения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

src/config/Reports/ОборотыМежду6001И6205/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	НастройкиКомпоновки = КомпоновщикНастроек.ПолучитьНастройки();
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновки, ДанныеРасшифровки,,,,);
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	
	ПараметрыПериод = НастройкиКомпоновки.ПараметрыДанных.Элементы.Найти("ПериодОтчета");
	ПараметрыОрганизация = НастройкиКомпоновки.ПараметрыДанных.Элементы.Найти("Организации");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организации", ПараметрыОрганизация.Значение);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Организации.Ссылка КАК Организация
	               |ИЗ
	               |	Справочник.Организации КАК Организации
	               |ГДЕ
	               |	Организации.Ссылка В ИЕРАРХИИ(&Организации)
	               |	И НЕ Организации.ЭтоГруппа";
	Организации = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Организация");
	//вн = Отчеты.ВНД.ВнешниеНаборыДанных(ПараметрыПериод.Значение.ДатаНачала, ПараметрыПериод.Значение.ДатаОкончания, Организации);
	Таблица = ВнешниеНаборыДанных(ПараметрыПериод.Значение.ДатаНачала, ПараметрыПериод.Значение.ДатаОкончания, Организации);
	вн = Новый Структура("Таблица", Таблица);
	
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, вн, ДанныеРасшифровки, Истина, Ложь,);
	//количество аргументов различается в разных релизах платформы ?
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

КонецПроцедуры

Функция ВнешниеНаборыДанных(НачалоПериода, КонецПериода, Организации)
	
	Результат = ИнициализироватьТаблицуРезультата();
	
	Запрос = мммСервер.ЗапросПрокси();
	Запрос.ТекстЗапроса = ТекстЗапроса();
	ТекПериод = НачалоПериода;
	Пока Истина Цикл
		Если ТекПериод > КонецПериода Тогда
			Прервать;
		КонецЕсли;

		Для Каждого Организация Из Организации Цикл
			
			Запрос.Параметры.Вставить("Организация", Организация);
			Запрос.Параметры.Вставить("ОрганизацияИНН", Организация.ИНН);
			Запрос.Параметры.Вставить("НачалоПериода", НачалоМесяца(ТекПериод));
			Запрос.Параметры.Вставить("КонецПериода", КонецМесяца(ТекПериод));
			Запрос.Параметры.Вставить("Месяц", НачалоМесяца(ТекПериод));
			
			Таб = мммСервер.ПолучитьТаблицуСерверов(ТекПериод, Организация);
			Для Каждого ТабЗапись Из Таб Цикл
				Если Не ТабЗапись.Пометка Тогда
					Продолжить;
				КонецЕсли;
			
				Попытка
					Прокси = мммСервер.ПолучитьПрокси(ТабЗапись.Сервер, ТабЗапись.База, ТабЗапись.Пользователь, ТабЗапись.Пароль);
				Исключение
					Попытка
						Прокси = мммСервер.ПолучитьПрокси(ТабЗапись.Сервер, ТабЗапись.База, ТабЗапись.Пользователь, ТабЗапись.Пароль);
					Исключение
						Попытка
							Прокси = мммСервер.ПолучитьПрокси(ТабЗапись.Сервер, ТабЗапись.База, ТабЗапись.Пользователь, ТабЗапись.Пароль);
						Исключение
							// обработка исключения создания прокси
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось подключиться к базе "+ Организация);
							Продолжить;
						КонецПопытки;
					КонецПопытки;
				КонецПопытки;
				
				Попытка
					Ответ = мммСервер.ДеСериализовать(
						Прокси.RunQuery(мммСервер.Сериализовать(Запрос))
					);

					Если НЕ Ответ.Ошибка Тогда
						ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Ответ.Результат, Результат);
					Иначе
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка формирования данных по фирме "+ Организация + Символы.ПС + Ответ.ОписаниеОшибки);
						Продолжить;
					КонецЕсли;
				Исключение
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка формирования данных по фирме "+ Организация);
					Продолжить;
				КонецПопытки;
			КонецЦикла;
			
		КонецЦикла;
		ТекПериод = НачалоМесяца(ДобавитьМесяц(ТекПериод, 1));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции


Функция ТекстЗапроса()
	Результат = "ВЫБРАТЬ
	|		ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка,
	|		ДополнительныеСведения.Объект КАК Объект,
	|		ДополнительныеСведения.Значение КАК Значение
	|	ПОМЕСТИТЬ ВТДопСвойство
	|	ИЗ
	|		РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|			ПО ДополнительныеСведения.Свойство = ДополнительныеРеквизитыИСведения.Ссылка
	|	ГДЕ
	|		ДополнительныеРеквизитыИСведения.Имя ПОДОБНО ""УпрАналитика%""
	|	;
	|	
	|	////////////////////////////////////////////////////////////////////////////////
	|	ВЫБРАТЬ
	|		ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПоставщиками) КАК Счет
	|	ПОМЕСТИТЬ ВТСчета
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетныеСчета)
	|	;
	|	
	|	////////////////////////////////////////////////////////////////////////////////
	|	ВЫБРАТЬ
	|		Счета.Ссылка КАК Счет
	|		 ПОМЕСТИТЬ ВТКорСчета
	|		ИЗ ПланСчетов.Хозрасчетный КАК Счета
	|		ГДЕ Счета.Код В (""62.05"")
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПокупателями)
	|
	|	;
	|	
	|	////////////////////////////////////////////////////////////////////////////////
	|	ВЫБРАТЬ ПЕРВЫЕ 0 РАЗРЕШЕННЫЕ
	|		ХозрасчетныйОстаткиИОбороты.Организация КАК Организация,
	|		ХозрасчетныйОстаткиИОбороты.Счет.Родитель КАК СчетРодитель,
	|		ХозрасчетныйОстаткиИОбороты.Счет КАК Счет,
	|		ХозрасчетныйОстаткиИОбороты.Субконто1 КАК Контрагент,
	|		ВЫБОР
	|			КОГДА НЕ УпрАналитика1.Значение ЕСТЬ NULL
	|				ТОГДА УпрАналитика1.Значение
	|			ИНАЧЕ ВЫБОР
	|					КОГДА НЕ УпрАналитика2.Значение ЕСТЬ NULL
	|						ТОГДА УпрАналитика2.Значение
	|					ИНАЧЕ ВЫБОР
	|							КОГДА НЕ УпрАналитика3.Значение ЕСТЬ NULL
	|								ТОГДА УпрАналитика3.Значение
	|							ИНАЧЕ ВЫБОР
	|									КОГДА НЕ УпрАналитика4.Значение ЕСТЬ NULL
	|										ТОГДА УпрАналитика4.Значение
	|									ИНАЧЕ ВЫБОР
	|											КОГДА НЕ УпрАналитика5.Значение ЕСТЬ NULL
	|												ТОГДА УпрАналитика5.Значение
	|											ИНАЧЕ НЕОПРЕДЕЛЕНО
	|										КОНЕЦ
	|								КОНЕЦ
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ КАК УпрАналитика,
	|		ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	|		ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстатокДт КАК НачальныйОстатокДт,
	|		ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстатокКт КАК НачальныйОстатокКт,
	|		0 КАК ОборотДт,
	|		0 КАК ОборотКт,
	|		ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
	|		ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстатокДт КАК КонечныйОстатокДт,
	|		ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстатокКт КАК КонечныйОстатокКт,
	|		NULL КАК КорСчет,
	|		NULL КАК КорУпрАналитика,
	|		NULL КАК КорСубконто
	|	ПОМЕСТИТЬ ВТДанные
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	|				&НачалоПериода,
	|				&КонецПериода,
	|				Авто,
	|				,
	|				Счет В ИЕРАРХИИ
	|					(ВЫБРАТЬ
	|						Т.Счет
	|					ИЗ
	|						ВТСчета КАК Т),
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты),
	|				Организация.ИНН = &ОрганизацияИНН) КАК ХозрасчетныйОстаткиИОбороты
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТДопСвойство КАК УпрАналитика1
	|			ПО (УпрАналитика1.Объект = ХозрасчетныйОстаткиИОбороты.Субконто1.Родитель)
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТДопСвойство КАК УпрАналитика2
	|			ПО (УпрАналитика2.Объект = ХозрасчетныйОстаткиИОбороты.Субконто1.Родитель.Родитель)
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТДопСвойство КАК УпрАналитика3
	|			ПО (УпрАналитика3.Объект = ХозрасчетныйОстаткиИОбороты.Субконто1.Родитель.Родитель.Родитель)
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТДопСвойство КАК УпрАналитика4
	|			ПО (УпрАналитика4.Объект = ХозрасчетныйОстаткиИОбороты.Субконто1.Родитель.Родитель.Родитель.Родитель)
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТДопСвойство КАК УпрАналитика5
	|			ПО (УпрАналитика5.Объект = ХозрасчетныйОстаткиИОбороты.Субконто1.Родитель.Родитель.Родитель.Родитель.Родитель)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ХозрасчетныйОбороты.Организация,
	|		ХозрасчетныйОбороты.Счет.Родитель,
	|		ХозрасчетныйОбороты.Счет,
	|		ХозрасчетныйОбороты.Субконто1,
	|		ВЫБОР
	|			КОГДА НЕ УпрАналитика1.Значение ЕСТЬ NULL
	|				ТОГДА УпрАналитика1.Значение
	|			ИНАЧЕ ВЫБОР
	|					КОГДА НЕ УпрАналитика2.Значение ЕСТЬ NULL
	|						ТОГДА УпрАналитика2.Значение
	|					ИНАЧЕ ВЫБОР
	|							КОГДА НЕ УпрАналитика3.Значение ЕСТЬ NULL
	|								ТОГДА УпрАналитика3.Значение
	|							ИНАЧЕ ВЫБОР
	|									КОГДА НЕ УпрАналитика4.Значение ЕСТЬ NULL
	|										ТОГДА УпрАналитика4.Значение
	|									ИНАЧЕ ВЫБОР
	|											КОГДА НЕ УпрАналитика5.Значение ЕСТЬ NULL
	|												ТОГДА УпрАналитика5.Значение
	|											ИНАЧЕ НЕОПРЕДЕЛЕНО
	|										КОНЕЦ
	|								КОНЕЦ
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ,
	|		0,
	|		0,
	|		0,
	|		ХозрасчетныйОбороты.СуммаОборотДт,
	|		ХозрасчетныйОбороты.СуммаОборотКт,
	|		0,
	|		0,
	|		0,
	|		ХозрасчетныйОбороты.КорСчет,
	|		ВЫБОР
	|			КОГДА НЕ КорУпрАналитика1.Значение ЕСТЬ NULL
	|				ТОГДА КорУпрАналитика1.Значение
	|			ИНАЧЕ ВЫБОР
	|					КОГДА НЕ КорУпрАналитика2.Значение ЕСТЬ NULL
	|						ТОГДА КорУпрАналитика2.Значение
	|					ИНАЧЕ ВЫБОР
	|							КОГДА НЕ КорУпрАналитика3.Значение ЕСТЬ NULL
	|								ТОГДА КорУпрАналитика3.Значение
	|							ИНАЧЕ ВЫБОР
	|									КОГДА НЕ КорУпрАналитика4.Значение ЕСТЬ NULL
	|										ТОГДА КорУпрАналитика4.Значение
	|									ИНАЧЕ ВЫБОР
	|											КОГДА НЕ КорУпрАналитика5.Значение ЕСТЬ NULL
	|												ТОГДА КорУпрАналитика5.Значение
	|											ИНАЧЕ НЕОПРЕДЕЛЕНО
	|										КОНЕЦ
	|								КОНЕЦ
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ,
	|		ХозрасчетныйОбороты.КорСубконто1
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Обороты(
	|				&НачалоПериода,
	|				&КонецПериода,
	|				Авто,
	|				Счет В ИЕРАРХИИ
	|					(ВЫБРАТЬ
	|						Т.Счет
	|					ИЗ
	|						ВТСчета КАК Т),
	|				,
	|				Организация.ИНН = &ОрганизацияИНН,
	|				КорСчет В ИЕРАРХИИ
	|					(ВЫБРАТЬ
	|						Т.Счет
	|					ИЗ
	|						ВТКорСчета КАК Т),
	|				) КАК ХозрасчетныйОбороты
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТДопСвойство КАК УпрАналитика1
	|			ПО (УпрАналитика1.Объект = ХозрасчетныйОбороты.Субконто1.Родитель)
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТДопСвойство КАК УпрАналитика2
	|			ПО (УпрАналитика2.Объект = ХозрасчетныйОбороты.Субконто1.Родитель.Родитель)
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТДопСвойство КАК УпрАналитика3
	|			ПО (УпрАналитика3.Объект = ХозрасчетныйОбороты.Субконто1.Родитель.Родитель.Родитель)
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТДопСвойство КАК УпрАналитика4
	|			ПО (УпрАналитика4.Объект = ХозрасчетныйОбороты.Субконто1.Родитель.Родитель.Родитель.Родитель)
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТДопСвойство КАК УпрАналитика5
	|			ПО (УпрАналитика5.Объект = ХозрасчетныйОбороты.Субконто1.Родитель.Родитель.Родитель.Родитель.Родитель)
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТДопСвойство КАК КорУпрАналитика1
	|			ПО (УпрАналитика1.Объект = ХозрасчетныйОбороты.КорСубконто1.Родитель)
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТДопСвойство КАК КорУпрАналитика2
	|			ПО (УпрАналитика2.Объект = ХозрасчетныйОбороты.КорСубконто1.Родитель.Родитель)
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТДопСвойство КАК КорУпрАналитика3
	|			ПО (УпрАналитика3.Объект = ХозрасчетныйОбороты.КорСубконто1.Родитель.Родитель.Родитель)
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТДопСвойство КАК КорУпрАналитика4
	|			ПО (УпрАналитика4.Объект = ХозрасчетныйОбороты.КорСубконто1.Родитель.Родитель.Родитель.Родитель)
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТДопСвойство КАК КорУпрАналитика5
	|			ПО (УпрАналитика5.Объект = ХозрасчетныйОбороты.КорСубконто1.Родитель.Родитель.Родитель.Родитель.Родитель)

	|	;
	|	
	|	////////////////////////////////////////////////////////////////////////////////
	|	ВЫБРАТЬ
	|		&Организация КАК Организация,
	|		&Месяц КАК Месяц,
	|		ПРЕДСТАВЛЕНИЕ(ВТДанные.СчетРодитель) КАК СчетРодитель,
	|		ПРЕДСТАВЛЕНИЕ(ВТДанные.Счет) КАК Счет,
	|		ПРЕДСТАВЛЕНИЕ(ВТДанные.УпрАналитика) КАК УпрАналитика,
	|		ВТДанные.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	|		ВТДанные.НачальныйОстатокДт КАК НачальныйОстатокДт,
	|		ВТДанные.НачальныйОстатокКт КАК НачальныйОстатокКт,
	|		ВТДанные.ОборотДт КАК ОборотДт,
	|		ВТДанные.ОборотКт КАК ОборотКт,
	|		ВТДанные.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
	|		ВТДанные.КонечныйОстатокДт КАК КонечныйОстатокДт,
	|		ВТДанные.КонечныйОстатокКт КАК КонечныйОстатокКт,
	|		ПРЕДСТАВЛЕНИЕ(ВТДанные.КорСчет) КАК КорСчет,
	|		ПРЕДСТАВЛЕНИЕ(ВТДанные.КорСубконто) КАК КорСубконто,
	|		ПРЕДСТАВЛЕНИЕ(ВТДанные.Контрагент) КАК Контрагент
	|	ИЗ
	|		ВТДанные КАК ВТДанные
	|	
	|";
	Возврат Результат;
КонецФункции

Функция ИнициализироватьТаблицуРезультата()

	Т = Новый ТаблицаЗначений;
	Т.Колонки.Добавить("Организация", ПолучитьОписаниеТипа(Тип("СправочникСсылка.Организации")));
	Т.Колонки.Добавить("Месяц", ПолучитьОписаниеТипа(Тип("Дата")));
	Т.Колонки.Добавить("СчетРодитель", ПолучитьОписаниеТипа(Тип("Строка")));
	Т.Колонки.Добавить("Счет", ПолучитьОписаниеТипа(Тип("Строка")));
	Т.Колонки.Добавить("УпрАналитика", ПолучитьОписаниеТипа(Тип("Строка")));
	Т.Колонки.Добавить("СуммаНачальныйОстаток", ПолучитьОписаниеТипа(Тип("Число")));
	Т.Колонки.Добавить("НачальныйОстатокДт", ПолучитьОписаниеТипа(Тип("Число")));
	Т.Колонки.Добавить("НачальныйОстатокКт", ПолучитьОписаниеТипа(Тип("Число")));
	Т.Колонки.Добавить("ОборотДт", ПолучитьОписаниеТипа(Тип("Число")));
	Т.Колонки.Добавить("ОборотКт", ПолучитьОписаниеТипа(Тип("Число")));
	Т.Колонки.Добавить("СуммаКонечныйОстаток", ПолучитьОписаниеТипа(Тип("Число")));
	Т.Колонки.Добавить("КонечныйОстатокДт", ПолучитьОписаниеТипа(Тип("Число")));
	Т.Колонки.Добавить("КонечныйОстатокКт", ПолучитьОписаниеТипа(Тип("Число")));
	Т.Колонки.Добавить("КорСчет", ПолучитьОписаниеТипа(Тип("Строка")));
	Т.Колонки.Добавить("КорСубконто", ПолучитьОписаниеТипа(Тип("Строка")));
	Т.Колонки.Добавить("Контрагент", ПолучитьОписаниеТипа(Тип("Строка")));
	
	Возврат Т;

КонецФункции

Функция ПолучитьОписаниеТипа(Тип, Квалификатор = Неопределено)
	
	Если ТипЗнч(Тип) = Тип("Массив") Тогда
		
		МассивТипов = Тип;
		
	ИначеЕсли ТипЗнч(Тип) = Тип("Структура") Тогда
		
		МассивТипов = Новый Массив;
		
		Для Каждого КиЗ Из Тип Цикл
			МассивТипов.Добавить(КиЗ.Значение);
		КонецЦикла;
		
	Иначе
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип);
		
	КонецЕсли;
	
	Возврат Новый ОписаниеТипов(МассивТипов, , , Квалификатор);
	
КонецФункции
